# Numpy

In [ ]:
import numpy as np

In [ ]:
a = np.array([1,2,3,4])
b = np.array([2,3,4,5])

In [ ]:
a*b

# Numpy Array'i Olusturmak

In [ ]:
np.array([1,2,3,4,5])

In [ ]:
a = np.array([1,2,3,4,5])

In [ ]:
type(a)

In [ ]:
np.array([3.14, 2 , 4, 6], dtype= "int")

# Sifirdan Array Olusturmak

In [ ]:
np.zeros(10, dtype="int")

In [ ]:
np.ones((3,5), dtype="int")

In [ ]:
np.full((3,5), 3)

### dogrusal bir dizi olusturmak icin

In [ ]:
np.arange(0, 31, 3)

### iki deger arasinda istedigimiz kadar deger olusturmak icin

In [ ]:
np.linspace(0,1,10)

### belirli bir standart sapma ve ortalama verip 2 boyutlu arrayin bilgisini biz tanimlamak istersek

In [ ]:
np.random.normal(10, 4, (3,4))

### int degerlerden rastgele bir sekilde olusturulmus bir veri istiyorsak

In [ ]:
np.random.randint(0,10,(3,3))

# Ozellikleri

* ndim: boyut sayisi
* shape: boyut bilgisi
* size: toplam eleman sayisi
* dtype: array veri tipi

In [ ]:
import numpy as np

In [ ]:
np.random.randint(10, size=10)

In [ ]:
a = np.random.randint(10, size=10)

In [ ]:
a.ndim

In [ ]:
a.shape

In [ ]:
a.size

In [ ]:
a.dtype

In [ ]:
b = np.random.randint(10, size=(3,5))

In [ ]:
b

In [ ]:
b.ndim

In [ ]:
b.shape

In [ ]:
b.size

In [ ]:
b.dtype

## Yeniden Sekillendirme(reshaping)

In [ ]:
import numpy as np

In [ ]:
np.arange(1,10)

In [ ]:
#amacimiz bu array uzerinden 3'e 3'luk yeni bir array olusturmak olsun

In [ ]:
np.arange(1,10).reshape(3,3)

In [ ]:
a = np.arange(1,10)

In [ ]:
a

In [ ]:
a.ndim

In [ ]:
b = a.reshape((1,9))

In [ ]:
b

In [ ]:
b.ndim

In [ ]:
#b'yi tek satir 9 sutunluk matrise esitledik

## Array Birlestirme(Concatenation)

In [ ]:
import numpy as np

In [ ]:
x = np.array([1,2,3])
y = np.array([4,5,6])

In [ ]:
np.concatenate([x,y])

In [ ]:
z = np.array([7,8,9])

In [ ]:
np.concatenate([x,y,z])

In [ ]:
#iki boyutlu için

In [ ]:
a = np.array([[1,2,3], 
              [4,5,6]])

In [ ]:
np.concatenate([a,a])

In [ ]:
#satir bazinda degil de sutun bazinda birlestirmek istersek axis degerini 1 yapmamiz gerekir

In [ ]:
np.concatenate([a,a], axis=1)

## Array Ayirma(Splitting)

In [ ]:
import numpy as np

In [ ]:
x = np.array([1,2,3,99,99,3,2,1])

In [ ]:
np.split(x, [3,5])

In [ ]:
a,b,c = np.split(x, [3,5])

In [ ]:
a

In [ ]:
b

In [ ]:
c

In [ ]:
#iki boyutlu ayirma

In [ ]:
m = np.arange(16).reshape(4,4)
m

In [ ]:
#ikinci satirdan sonraki kismi bolum yana dikey olarak eklemek istersek

In [ ]:
np.vsplit(m, [2])

In [ ]:
ust, alt = np.vsplit(m, [2])

In [ ]:
ust

In [ ]:
alt

In [ ]:
#sutundan bolmek istersek

In [ ]:
m

In [ ]:
np.hsplit(m, [2])

In [ ]:
sag, sol = np.hsplit(m, [2])

In [ ]:
sag

In [ ]:
sol

## Array Siralama(Sorting)

In [ ]:
import numpy as np

In [ ]:
v = np.array([2,1,4,3,5])

In [ ]:
v

In [ ]:
np.sort(v)

In [ ]:
v

In [ ]:
v.sort()

In [ ]:
v

In [ ]:
#iki boyutlu array siralama

In [ ]:
m = np.random.normal(20,5, (3,3))

In [ ]:
m

In [ ]:
#satirlari siralamak istedigimizi dusunursek

In [ ]:
np.sort(m, axis=1)

In [ ]:
#sütunlari siralamak istersek

In [ ]:
np.sort(m, axis=0)

## Index ile Elemanlara Erismek

In [ ]:
import numpy as np

In [ ]:
a = np.random.randint(10,size=10)

In [ ]:
a

In [ ]:
a[0]

In [ ]:
a[-1]

In [ ]:
a[0]=100

In [ ]:
a

In [ ]:
m = np.random.randint(10,size=(3,5))
m

In [ ]:
m[0,0]

In [ ]:
m[1,1]

In [ ]:
m[1,4] = 99

In [ ]:
m

## Slicing ile Elemanlara Erişmek(Array Alt Kümesine Erişmek)

In [ ]:
import numpy as np

In [ ]:
a = np.arange(20,30)

In [ ]:
a

In [ ]:
a[0:3]

In [ ]:
a[1::2]

In [ ]:
a[0::2]

In [ ]:
#iki boyutlularda slice işlemi

In [ ]:
m = np.random.randint(10, size=(5,5))

In [ ]:
m

In [ ]:
m[:,0]

In [ ]:
m[:,1]

In [ ]:
m[0,:]

In [ ]:
m[0]

In [ ]:
m[1,:]

In [ ]:
m[0:2, 0:3]

In [ ]:
m[1:3, 0:2]

## Alt Kume Uzerinde Islem Yapmak

In [ ]:
import numpy as np
a = np.random.randint(10, size=(5,5))
a

In [ ]:
alt_a = a[0:3, 0:2]
alt_a

In [ ]:
alt_a[0,0]=999
alt_a[1,1]=888

In [ ]:
alt_a

In [ ]:
a

In [ ]:
#Goruldugu gibi ana array bozuldu bozulmaması için copy metodunu kullanmalıyız.

In [ ]:
m = np.random.randint(10, size=(5,5))
m

In [ ]:
alt_b = m[0:3, 0:2].copy()
alt_b

In [ ]:
alt_b[0,0]=1500

In [ ]:
alt_b

In [ ]:
m

## Fancy Index ile Elemanlara Erismek

In [ ]:
import numpy as np
v = np.arange(0,30,3)
v

In [ ]:
v[1]

In [ ]:
v[3]

In [ ]:
v[5]

In [ ]:
[v[1], v[3], v[5]]

In [ ]:
al_getir = [1,3,5]

In [ ]:
v

In [ ]:
v[al_getir]

In [ ]:
#iki boyutta fancy

In [ ]:
m = np.arange(9).reshape((3,3))

In [ ]:
m

In [ ]:
satir = np.array([0,1])
sutun = np.array([1,2])

In [ ]:
m[satir,sutun]

In [ ]:
#basit index ile fancy index

In [ ]:
m

In [ ]:
m[0, [1,2]]

In [ ]:
#slice ile fancy

In [ ]:
m[0:, [1,2]]

## Kosullu Eleman Islemleri

In [ ]:
import numpy as np

In [ ]:
v = np.array([1,2,3,4,5])

In [ ]:
v < 3

In [ ]:
v[v<3]

In [ ]:
v[v>=2]

In [ ]:
v[v==4]

In [ ]:
v[v!=3]

In [ ]:
v

In [ ]:
v*2

In [ ]:
v/5

In [ ]:
v**2

## Matematiksel Islemler

In [ ]:
import numpy as np

In [ ]:
v = np.array([1,2,3,4,5])

In [ ]:
v + 1

In [ ]:
v-1

In [ ]:
v*5

In [ ]:
v/2

In [ ]:
#ufunc calisiyor bu islemleri yaparken

In [ ]:
np.add(v,1)

In [ ]:
np.subtract(v,2)

In [ ]:
np.multiply(v,4)

In [ ]:
np.divide(v,3)

In [ ]:
v**2

In [ ]:
v**3

In [ ]:
np.power(v,3)

In [ ]:
v % 2

In [ ]:
np.mod(v,2)

In [ ]:
np.sin(360)

In [ ]:
np.cos(180)

In [ ]:
v = np.array([1,2,3])

In [ ]:
np.log(v)

In [ ]:
np.log2(v)

In [ ]:
np.log10(v)

## Istatistiksel Hesaplamalar

In [ ]:
v

In [ ]:
v.mean()

In [ ]:
v.sum()

In [ ]:
v.min()

In [ ]:
v.max()

# PANDAS

## Pandas Serisi Olusturmak

In [ ]:
import pandas as pd

In [ ]:
pd.Series([10,88,3,4,5])

In [ ]:
seri = pd.Series([10,88,3,4,5])

In [ ]:
type(seri)

In [ ]:
seri.axes

In [ ]:
seri.dtype

In [ ]:
seri.size

In [ ]:
seri.ndim

In [ ]:
seri.values

In [ ]:
seri.head(3)

In [ ]:
seri.tail(3)

In [ ]:
#Index isimlendirme

In [ ]:
pd.Series([99,85,76,47,5])

In [ ]:
pd.Series([99,85,76,47,5], index=[1,2,3,4,5])

In [ ]:
pd.Series([99,85,76,47,5], index=["a","b","c","d","e"])

In [ ]:
seri = pd.Series([99,85,76,47,5], index=["a","b","c","d","e"])

In [ ]:
seri["a"]

In [ ]:
seri["a":"c"]

In [ ]:
#Sozluk uzerinden liste olusturmak

In [ ]:
sozluk = {"reg":10, "log":11, "cart":12}

In [ ]:
seri = pd.Series(sozluk)

In [ ]:
seri

In [ ]:
#Iki seriyi birlestirerek seri olusturma

In [ ]:
pd.concat([seri,seri])

## Eleman islemleri

In [ ]:
import numpy as np
import pandas as pd 

a=np.array([956,75,86,62,60])
seri=pd.Series(a)
seri

In [ ]:
seri[0]

In [ ]:
seri[0:3]

In [ ]:
seri = pd.Series([121,250,175,99], index=["reg","loj","cart","rf"])

In [ ]:
seri

In [ ]:
seri.index

In [ ]:
seri.keys

In [ ]:
list(seri.items())

In [ ]:
seri.values

In [ ]:
#eleman sorgulama

In [ ]:
"reg" in seri

In [ ]:
"a" in seri

In [ ]:
seri["reg"]

In [ ]:
#fancy eleman

In [ ]:
seri[["rf", "reg"]]

In [ ]:
seri["reg"]=130

In [ ]:
seri["reg"]

In [ ]:
seri["reg":"loj"]

## Pandas DataFrame Olusturma

In [ ]:
import pandas as pd

In [ ]:
l = [1,2,39,67,90]

In [ ]:
l

In [ ]:
pd.DataFrame(l, columns=["degisken_ismi"])

In [ ]:
import numpy as np
m=np.arange(1,10).reshape((3,3))
m

In [ ]:
pd.DataFrame(m, columns=["var1","var2","var3"])

In [ ]:
#df isimlendirme

In [ ]:
df = pd.DataFrame(m, columns=["var1","var2","var3"])
df.head()

In [ ]:
df.columns=["deg1","deg2","deg3"]

In [ ]:
df

In [ ]:
type(df)

In [ ]:
df.axes

In [ ]:
df.shape

In [ ]:
df.ndim

In [ ]:
df.size

In [ ]:
df.values

In [ ]:
type(df.values)

In [ ]:
df.head()

In [ ]:
df.tail(1)

## DataFrame Eleman Islemleri

In [70]:
import numpy as np

s1 = np.random.randint(10, size=5)
s2 = np.random.randint(10, size=5)
s3 = np.random.randint(10, size=5)

In [71]:
sozluk = {"var1":s1, "var2":s2, "var3":s3}

In [72]:
sozluk

{'var1': array([5, 1, 5, 1, 9]),
 'var2': array([8, 9, 0, 4, 5]),
 'var3': array([7, 1, 2, 2, 9])}

In [73]:
df = pd.DataFrame(sozluk)

In [74]:
df

   var1  var2  var3
0     5     8     7
1     1     9     1
2     5     0     2
3     1     4     2
4     9     5     9

In [75]:
df[0:1]

   var1  var2  var3
0     5     8     7

In [76]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [77]:
df.index = ["a","b","c","d","e"]

In [78]:
df

   var1  var2  var3
a     5     8     7
b     1     9     1
c     5     0     2
d     1     4     2
e     9     5     9

In [79]:
df["c":"e"]

   var1  var2  var3
c     5     0     2
d     1     4     2
e     9     5     9

In [80]:
df.drop("a", axis=0)

   var1  var2  var3
b     1     9     1
c     5     0     2
d     1     4     2
e     9     5     9

In [81]:
df

   var1  var2  var3
a     5     8     7
b     1     9     1
c     5     0     2
d     1     4     2
e     9     5     9

In [82]:
df.drop("a", axis=0, inplace=True)

In [83]:
df

   var1  var2  var3
b     1     9     1
c     5     0     2
d     1     4     2
e     9     5     9

In [84]:
#fancy ile silme

In [86]:
l = ["c","e"]

In [87]:
df.drop(l, axis=0)

   var1  var2  var3
b     1     9     1
d     1     4     2

In [88]:
#degiskenler için

In [89]:
df

   var1  var2  var3
b     1     9     1
c     5     0     2
d     1     4     2
e     9     5     9

In [90]:
"var1" in df

True

In [91]:
l = ["var1","var4","var2"]

In [92]:
for i in l:
    print(i in df)

True
False
True

In [103]:
df["var4"] = df["var2"] / df["var1"]

In [104]:
df

   var1  var2  var3      var4
b     1     9     1  9.000000
c     5     0     2  0.000000
d     1     4     2  4.000000
e     9     5     9  0.555556

In [105]:
#Degisken Silmek

In [106]:
df.drop("var4", axis=1)

   var1  var2  var3
b     1     9     1
c     5     0     2
d     1     4     2
e     9     5     9

In [107]:
df

   var1  var2  var3      var4
b     1     9     1  9.000000
c     5     0     2  0.000000
d     1     4     2  4.000000
e     9     5     9  0.555556

In [108]:
df.drop("var4", axis=1, inplace=True)

In [109]:
df

   var1  var2  var3
b     1     9     1
c     5     0     2
d     1     4     2
e     9     5     9

In [110]:
l = ["var1","var2"]

In [111]:
df.drop(l, axis=1)

   var3
b     1
c     2
d     2
e     9

## Gozlem ve Degisken Secimi: loc & iloc

In [16]:
import pandas as pd 
import numpy as np
m = np.random.randint(1,30, size=(10,3))
df = pd.DataFrame(m, columns=["var1","var2","var3"])
df

   var1  var2  var3
0    24     5     3
1    21    20     6
2    23     1    10
3    11     1    15
4     8    24    26
5     9     3    19
6    21     3    16
7     4     3    25
8     8    11    11
9    17    12     6

In [17]:
#loc: tanımlandıgı sekliyle secim yapmak icin kullanilir.

In [117]:
df.loc[0:3]

   var1  var2  var3
0     1    27    20
1    23    17     9
2    26     4    29
3    18    26     9

In [118]:
#iloc: alisik oldugumuz indeksleme mantigi ile secim yapar.

In [119]:
df.iloc[0:3]

   var1  var2  var3
0     1    27    20
1    23    17     9
2    26     4    29

In [121]:
df.iloc[0,0]

1

In [122]:
df.iloc[:3,:2]

   var1  var2
0     1    27
1    23    17
2    26     4

In [123]:
df.loc[0:3, "var3"]

0    20
1     9
2    29
3     9
Name: var3, dtype: int32

In [124]:
df.iloc[0:3]["var3"]

0    20
1     9
2    29
Name: var3, dtype: int32

## Kosullu Eleman Islemleri

In [1]:
import numpy as np
import pandas as pd

In [4]:
m = np.random.randint(1,30, size=(10,3))
df = pd.DataFrame(m, columns=["var1","var2","var3"])
df

   var1  var2  var3
0    12    15    24
1    22    10    20
2    19     9     8
3     5    22     6
4     3    13     2
5     5     1     4
6    18    19     3
7    29     9     4
8    28    26    15
9     8    25    26

In [5]:
df["var1"]

0    12
1    22
2    19
3     5
4     3
5     5
6    18
7    29
8    28
9     8
Name: var1, dtype: int32

In [6]:
df["var1"][0:2]

0    12
1    22
Name: var1, dtype: int32

In [7]:
df[0:2]

   var1  var2  var3
0    12    15    24
1    22    10    20

In [8]:
df[0:2][["var1","var2"]]

   var1  var2
0    12    15
1    22    10

In [10]:
df[df.var1>15]

   var1  var2  var3
1    22    10    20
2    19     9     8
6    18    19     3
7    29     9     4
8    28    26    15

In [11]:
df[df.var1>15]["var1"]

1    22
2    19
6    18
7    29
8    28
Name: var1, dtype: int32

In [12]:
df[(df.var1>15) & (df.var3<5)]

   var1  var2  var3
6    18    19     3
7    29     9     4

In [13]:
df.loc[(df.var1>15), ["var1","var2"]]

   var1  var2
1    22    10
2    19     9
6    18    19
7    29     9
8    28    26

In [14]:
#yukarıdakinin bir diger sekilde yapilisi

In [15]:
df[(df.var1>15)][["var1","var2"]]

   var1  var2
1    22    10
2    19     9
6    18    19
7    29     9
8    28    26

## Birlestirme(join) Islemleri

In [20]:
import pandas as pd 
import numpy as np
m = np.random.randint(1,30, size=(5,3))
df1 = pd.DataFrame(m, columns=["var1","var2","var3"])
df1

   var1  var2  var3
0     6    29    15
1    13     5     9
2     8     9     4
3    29     3    17
4     8    18    14

In [21]:
df2=df1+99

In [22]:
df2

   var1  var2  var3
0   105   128   114
1   112   104   108
2   107   108   103
3   128   102   116
4   107   117   113

In [24]:
pd.concat([df1,df2])

   var1  var2  var3
0     6    29    15
1    13     5     9
2     8     9     4
3    29     3    17
4     8    18    14
0   105   128   114
1   112   104   108
2   107   108   103
3   128   102   116
4   107   117   113

In [25]:
?pd.concat

Signature:
pd.concat(
    objs: Union[Iterable[ForwardRef('NDFrame')], Mapping[Union[Hashable, NoneType], ForwardRef('NDFrame')]],
    axis=0,
    join='outer',
    ignore_index: bool = False,
    keys=None,
    levels=None,
    names=None,
    verify_integrity: bool = False,
    sort: bool = False,
    copy: bool = True,
) -> Union[ForwardRef('DataFrame'), ForwardRef('Series')]
Docstring:
Concatenate pandas objects along a particular axis with optional set logic
along the other axes.

Can also add a layer of hierarchical indexing on the concatenation axis,
which may be useful if the labels are the same (or overlapping) on
the passed axis number.

Parameters
----------
objs : a sequence or mapping of Series or DataFrame objects
    If a mapping is passed, the sorted keys will be used as the `keys`
    argument, unless it is passed, in which case the values will be
    selected (see below). Any None objects will be dropped silently unless
    they are all None in which case a ValueError will be raised.
axis : {0/'index', 1/'columns'}, default 0
    The axis to concatenate along.
join : {'inner', 'outer'}, default 'outer'
    How to handle indexes on other axis (or axes).
ignore_index : bool, default False
    If True, do not use the index values along the concatenation axis. The
    resulting axis will be labeled 0, ..., n - 1. This is useful if you are
    concatenating objects where the concatenation axis does not have
    meaningful indexing information. Note the index values on the other
    axes are still respected in the join.
keys : sequence, default None
    If multiple levels passed, should contain tuples. Construct
    hierarchical index using the passed keys as the outermost level.
levels : list of sequences, default None
    Specific levels (unique values) to use for constructing a
    MultiIndex. Otherwise they will be inferred from the keys.
names : list, default None
    Names for the levels in the resulting hierarchical index.
verify_integrity : bool, default False
    Check whether the new concatenated axis contains duplicates. This can
    be very expensive relative to the actual data concatenation.
sort : bool, default False
    Sort non-concatenation axis if it is not already aligned when `join`
    is 'outer'.
    This has no effect when ``join='inner'``, which already preserves
    the order of the non-concatenation axis.

    .. versionchanged:: 1.0.0

       Changed to not sort by default.

copy : bool, default True
    If False, do not copy data unnecessarily.

Returns
-------
object, type of objs
    When concatenating all ``Series`` along the index (axis=0), a
    ``Series`` is returned. When ``objs`` contains at least one
    ``DataFrame``, a ``DataFrame`` is returned. When concatenating along
    the columns (axis=1), a ``DataFrame`` is returned.

See Also
--------
Series.append : Concatenate Series.
DataFrame.append : Concatenate DataFrames.
DataFrame.join : Join DataFrames using indexes.
DataFrame.merge : Merge DataFrames by indexes or columns.

Notes
-----
The keys, levels, and names arguments are all optional.

A walkthrough of how this method fits in with other tools for combining
pandas objects can be found `here
<https://pandas.pydata.org/pandas-docs/stable/user_guide/merging.html>`__.

Examples
--------
Combine two ``Series``.

>>> s1 = pd.Series(['a', 'b'])
>>> s2 = pd.Series(['c', 'd'])
>>> pd.concat([s1, s2])
0    a
1    b
0    c
1    d
dtype: object

Clear the existing index and reset it in the result
by setting the ``ignore_index`` option to ``True``.

>>> pd.concat([s1, s2], ignore_index=True)
0    a
1    b
2    c
3    d
dtype: object

Add a hierarchical index at the outermost level of
the data with the ``keys`` option.

>>> pd.concat([s1, s2], keys=['s1', 's2'])
s1  0    a
    1    b
s2  0    c
    1    d
dtype: object

Label the index keys you create with the ``names`` option.

>>> pd.concat([s1, s2], keys=['s1', 's2'],
...           names=['Series name', 'Row ID'])
Series name  Row ID
s1           0         a
             1         b
s2           0         c
             1         d
dtype: object

Combine two ``DataFrame`` objects with identical columns.

>>> df1 = pd.DataFrame([['a', 1], ['b', 2]],
...                    columns=['letter', 'number'])
>>> df1
  letter  number
0      a       1
1      b       2
>>> df2 = pd.DataFrame([['c', 3], ['d', 4]],
...                    columns=['letter', 'number'])
>>> df2
  letter  number
0      c       3
1      d       4
>>> pd.concat([df1, df2])
  letter  number
0      a       1
1      b       2
0      c       3
1      d       4

Combine ``DataFrame`` objects with overlapping columns
and return everything. Columns outside the intersection will
be filled with ``NaN`` values.

>>> df3 = pd.DataFrame([['c', 3, 'cat'], ['d', 4, 'dog']],
...                    columns=['letter', 'number', 'animal'])
>>> df3
  letter  number animal
0      c       3    cat
1      d       4    dog
>>> pd.concat([df1, df3], sort=False)
  letter  number animal
0      a       1    NaN
1      b       2    NaN
0      c       3    cat
1      d       4    dog

Combine ``DataFrame`` objects with overlapping columns
and return only those that are shared by passing ``inner`` to
the ``join`` keyword argument.

>>> pd.concat([df1, df3], join="inner")
  letter  number
0      a       1
1      b       2
0      c       3
1      d       4

Combine ``DataFrame`` objects horizontally along the x axis by
passing in ``axis=1``.

>>> df4 = pd.DataFrame([['bird', 'polly'], ['monkey', 'george']],
...                    columns=['animal', 'name'])
>>> pd.concat([df1, df4], axis=1)
  letter  number  animal    name
0      a       1    bird   polly
1      b       2  monkey  george

Prevent the result from including duplicate index values with the
``verify_integrity`` option.

>>> df5 = pd.DataFrame([1], index=['a'])
>>> df5
   0
a  1
>>> df6 = pd.DataFrame([2], index=['a'])
>>> df6
   0
a  2
>>> pd.concat([df5, df6], verify_integrity=True)
Traceback (most recent call last):
    ...
ValueError: Indexes have overlapping values: ['a']
File:      c:\users\lenovo\anaconda3\lib\site-packages\pandas\core\reshape\concat.py
Type:      function

In [26]:
pd.concat([df1,df2], ignore_index=True)

   var1  var2  var3
0     6    29    15
1    13     5     9
2     8     9     4
3    29     3    17
4     8    18    14
5   105   128   114
6   112   104   108
7   107   108   103
8   128   102   116
9   107   117   113

In [27]:
# ignore_index'i true yaparak indeksteki sıralamayı düzelttik.

In [28]:
df2.columns

Index(['var1', 'var2', 'var3'], dtype='object')

In [29]:
df2.columns=["var1","var2","deg3"]

In [30]:
df2

   var1  var2  deg3
0   105   128   114
1   112   104   108
2   107   108   103
3   128   102   116
4   107   117   113

In [31]:
pd.concat([df1,df2])

   var1  var2  var3   deg3
0     6    29  15.0    NaN
1    13     5   9.0    NaN
2     8     9   4.0    NaN
3    29     3  17.0    NaN
4     8    18  14.0    NaN
0   105   128   NaN  114.0
1   112   104   NaN  108.0
2   107   108   NaN  103.0
3   128   102   NaN  116.0
4   107   117   NaN  113.0

In [32]:
pd.concat([df1,df2], join="inner")

   var1  var2
0     6    29
1    13     5
2     8     9
3    29     3
4     8    18
0   105   128
1   112   104
2   107   108
3   128   102
4   107   117

In [33]:
#join="inner" islemi ile farklı baslıkları olan 2 veri grubunun ortak baslıklarını yani kesisimlerini aldık

## Ileri Birlestirme Islemleri

In [35]:
import pandas as pd
import numpy as np

In [36]:
#birebir birlestirme

In [39]:
df1= pd.DataFrame({'calisanlar': ['Ayse','Ali','Veli','Fatma'],
                  'grup': ['Muhasebe','Muhendis','Muhendislik','IK']})
df1

  calisanlar         grup
0       Ayse     Muhasebe
1        Ali     Muhendis
2       Veli  Muhendislik
3      Fatma           IK

In [40]:
df2= pd.DataFrame({'calisanlar': ['Ayse','Ali','Veli','Fatma'],
                   'ilk_giris':[2010,2009,2014,2019]})
df2

  calisanlar  ilk_giris
0       Ayse       2010
1        Ali       2009
2       Veli       2014
3      Fatma       2019

In [41]:
pd.merge(df1, df2)

  calisanlar         grup  ilk_giris
0       Ayse     Muhasebe       2010
1        Ali     Muhendis       2009
2       Veli  Muhendislik       2014
3      Fatma           IK       2019

In [42]:
#coktan teke

In [43]:
df3 = pd.merge(df1, df2)

In [44]:
df3

  calisanlar         grup  ilk_giris
0       Ayse     Muhasebe       2010
1        Ali     Muhendis       2009
2       Veli  Muhendislik       2014
3      Fatma           IK       2019

In [49]:
df4 = pd.DataFrame({'grup': ['Muhasebe','Muhendislik','IK'],
                   'mudur': ['Caner','Mustafa','Berkcan']})
df4

          grup    mudur
0     Muhasebe    Caner
1  Muhendislik  Mustafa
2           IK  Berkcan

In [51]:
pd.merge(df3,df4)

  calisanlar         grup  ilk_giris    mudur
0       Ayse     Muhasebe       2010    Caner
1       Veli  Muhendislik       2014  Mustafa
2      Fatma           IK       2019  Berkcan

In [52]:
# coktan coka

In [56]:
df5 = pd.DataFrame({'grup': ['Muhasebe','Muhasebe',
                             'Muhendislik','Muhendislik','IK','IK'],
                   'yetenekler': ['matematik','exel','kodlama','linux',
                                  'exel','yonetim']})
df5

          grup yetenekler
0     Muhasebe  matematik
1     Muhasebe       exel
2  Muhendislik    kodlama
3  Muhendislik      linux
4           IK       exel
5           IK    yonetim

df1

In [58]:
pd.merge(df1,df5)

  calisanlar         grup yetenekler
0       Ayse     Muhasebe  matematik
1       Ayse     Muhasebe       exel
2       Veli  Muhendislik    kodlama
3       Veli  Muhendislik      linux
4      Fatma           IK       exel
5      Fatma           IK    yonetim

## Toplulastirma ve Gruplama (Aggregation & Grouping)

In [5]:
#Basit toplulastirma fonksiyonlari

#count()
#first()
#last()
#mean()
#median()
#min()
#max()
#std()
#var()
#sum()

In [7]:
import seaborn as sns

In [8]:
df = sns.load_dataset("planets")
df.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [9]:
df.shape

(1035, 6)

In [12]:
df.mean()

number               1.785507
orbital_period    2002.917596
mass                 2.638161
distance           264.069282
year              2009.070531
dtype: float64

In [13]:
df["mass"].mean()

2.6381605847953233

In [14]:
df["mass"].max()

25.0

In [15]:
df["mass"].min()

0.0036

In [16]:
df["mass"].std()

3.8186166509616046

In [18]:
df.describe()

            number  orbital_period        mass     distance         year
count  1035.000000      992.000000  513.000000   808.000000  1035.000000
mean      1.785507     2002.917596    2.638161   264.069282  2009.070531
std       1.240976    26014.728304    3.818617   733.116493     3.972567
min       1.000000        0.090706    0.003600     1.350000  1989.000000
25%       1.000000        5.442540    0.229000    32.560000  2007.000000
50%       1.000000       39.979500    1.260000    55.250000  2010.000000
75%       2.000000      526.005000    3.040000   178.500000  2012.000000
max       7.000000   730000.000000   25.000000  8500.000000  2014.000000

In [19]:
df.describe().T

,count,mean,std,min,25%,50%,75%,max
number,1035.0,1.785507,1.240976,1.000000,1.00000,1.0000,2.000,7.0
orbital_period,992.0,2002.917596,26014.728304,0.090706,5.44254,39.9795,526.005,730000.0
mass,513.0,2.638161,3.818617,0.003600,0.22900,1.2600,3.040,25.0
distance,808.0,264.069282,733.116493,1.350000,32.56000,55.2500,178.500,8500.0
year,1035.0,2009.070531,3.972567,1989.000000,2007.00000,2010.0000,2012.000,2014.0

## Gruplama İslemleri

In [20]:
import numpy as np 
import pandas as pd

In [23]:
df = pd.DataFrame({'gruplar':['A','B','C','A','B','C'],
                  'veri':[10,11,52,23,43,55]}, columns=['gruplar','veri'])
df

  gruplar  veri
0       A    10
1       B    11
2       C    52
3       A    23
4       B    43
5       C    55

In [26]:
df.groupby("gruplar")

In [27]:
df.groupby("gruplar").mean()

         veri
gruplar
A        16.5
B        27.0
C        53.5

In [28]:
df.groupby("gruplar").sum()

         veri
gruplar
A          33
B          54
C         107

In [29]:
df = sns.load_dataset("planets")
df.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [30]:
df.groupby("method")

In [31]:
df.groupby("method")["orbital_period"].mean()

method
Astrometry                          631.180000
Eclipse Timing Variations          4751.644444
Imaging                          118247.737500
Microlensing                       3153.571429
Orbital Brightness Modulation         0.709307
Pulsar Timing                      7343.021201
Pulsation Timing Variations        1170.000000
Radial Velocity                     823.354680
Transit                              21.102073
Transit Timing Variations            79.783500
Name: orbital_period, dtype: float64

In [32]:
df.groupby("method")["orbital_period"].describe()

,count,mean,std,min,25%,50%,75%,max
method,,,,,,,,
Astrometry,2.0,631.180000,544.217663,246.360000,438.770000,631.180000,823.590000,1016.000000
Eclipse Timing Variations,9.0,4751.644444,2499.130945,1916.250000,2900.000000,4343.500000,5767.000000,10220.000000
Imaging,12.0,118247.737500,213978.177277,4639.150000,8343.900000,27500.000000,94250.000000,730000.000000
Microlensing,7.0,3153.571429,1113.166333,1825.000000,2375.000000,3300.000000,3550.000000,5100.000000
Orbital Brightness Modulation,3.0,0.709307,0.725493,0.240104,0.291496,0.342887,0.943908,1.544929
Pulsar Timing,5.0,7343.021201,16313.265573,0.090706,25.262000,66.541900,98.211400,36525.000000
Pulsation Timing Variations,1.0,1170.000000,NaN,1170.000000,1170.000000,1170.000000,1170.000000,1170.000000
Radial Velocity,553.0,823.354680,1454.926210,0.736540,38.021000,360.200000,982.000000,17337.500000
Transit,397.0,21.102073,46.185893,0.355000,3.160630,5.714932,16.145700,331.600590
Transit Timing Variations,3.0,79.783500,71.599884,22.339500,39.675250,57.011000,108.505500,160.000000

## Ileri Toplulastirma Islemleri(Aggregate, filter, transform, apply )

In [33]:
import pandas as pd
df=pd.DataFrame({'gruplar':['A','B','C','A','B','C'],
                 'degisken1':[10,23,33,22,11,99],
                 'degisken2':[100,253,333,262,11,969]}, columns=['gruplar','degisken1','degisken2']) 
df

  gruplar  degisken1  degisken2
0       A         10        100
1       B         23        253
2       C         33        333
3       A         22        262
4       B         11         11
5       C         99        969

In [34]:
#Aggregate

In [36]:
df.groupby("gruplar").aggregate([min,np.median,max])

        degisken1            degisken2
              min median max       min median  max
gruplar
A              10     16  22       100    181  262
B              11     17  23        11    132  253
C              33     66  99       333    651  969

In [37]:
df.groupby("gruplar").aggregate({'degisken1':'min', 'degisken2':'max'})

         degisken1  degisken2
gruplar
A               10        262
B               11        253
C               33        969

In [1]:
#filter

In [3]:
import pandas as pd
df = pd.DataFrame({'gruplar':['A','B','C','A','B','C'],
                   'degisken1':[10,23,33,22,11,99],
                   'degisken2':[100,253,333,262,11,969]}, columns=['gruplar','degisken1','degisken2'])
df

  gruplar  degisken1  degisken2
0       A         10        100
1       B         23        253
2       C         33        333
3       A         22        262
4       B         11         11
5       C         99        969

In [4]:
def filter_func(x):
    return x["degisken1"].std()>9

In [5]:
df.groupby("gruplar").std()

         degisken1   degisken2
gruplar
A         8.485281  114.551299
B         8.485281  171.119841
C        46.669048  449.719913

In [6]:
df.groupby("gruplar").filter(filter_func)

  gruplar  degisken1  degisken2
2       C         33        333
5       C         99        969

In [7]:
#transform

In [16]:
import pandas as pd
df = pd.DataFrame({'gruplar':['A','B','C','A','B','C'],
                   'degisken1':[10,23,33,22,11,99],
                   'degisken2':[100,253,333,262,111,969]}, columns=['gruplar','degisken1','degisken2'])
df

  gruplar  degisken1  degisken2
0       A         10        100
1       B         23        253
2       C         33        333
3       A         22        262
4       B         11        111
5       C         99        969

In [17]:
df["degisken1"]*9

0     90
1    207
2    297
3    198
4     99
5    891
Name: degisken1, dtype: int64

In [19]:
df_a = df.iloc[:,1:3]

In [20]:
df_a.transform(lambda x: (x-x.mean() / x.std()))

   degisken1   degisken2
0   9.013055   98.951261
1  22.013055  251.951261
2  32.013055  331.951261
3  21.013055  260.951261
4  10.013055  109.951261
5  98.013055  967.951261

In [21]:
#apply

In [28]:
import numpy as np
import pandas as pd
df = pd.DataFrame({'gruplar':['A','B','C','A','B','C'],
                   'degisken1':[10,23,33,22,11,99],
                   'degisken2':[100,253,333,262,111,969]}, columns=['gruplar','degisken1','degisken2'])
df

  gruplar  degisken1  degisken2
0       A         10        100
1       B         23        253
2       C         33        333
3       A         22        262
4       B         11        111
5       C         99        969

In [26]:
df.apply(np.sum)

degisken1     198
degisken2    2028
dtype: int64

In [27]:
df.apply(np.mean)

degisken1     33.0
degisken2    338.0
dtype: float64

In [29]:
df.groupby("gruplar").apply(np.sum)

        gruplar  degisken1  degisken2
gruplar
A            AA         32        362
B            BB         34        364
C            CC        132       1302

## Pivot Tablolar

In [31]:
import pandas as pd
import seaborn as sns
titanic = sns.load_dataset("titanic")
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [34]:
titanic.groupby("sex")[["survived"]].mean()

        survived
sex
female  0.742038
male    0.188908

In [35]:
titanic.groupby(["sex","class"])[["survived"]].aggregate("mean").unstack()

        survived
class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [36]:
#pivot ile table

In [38]:
titanic.pivot_table("survived", index="sex", columns="class")

class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [39]:
titanic.age.head()

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
Name: age, dtype: float64

In [40]:
age = pd.cut(titanic["age"], [0,18,90])
age.head(10)

0    (18.0, 90.0]
1    (18.0, 90.0]
2    (18.0, 90.0]
3    (18.0, 90.0]
4    (18.0, 90.0]
5             NaN
6    (18.0, 90.0]
7     (0.0, 18.0]
8    (18.0, 90.0]
9     (0.0, 18.0]
Name: age, dtype: category
Categories (2, interval[int64]): [(0, 18] < (18, 90]]

In [43]:
titanic.pivot_table("survived", ["sex",age], "class")

class               First    Second     Third
sex    age
female (0, 18]   0.909091  1.000000  0.511628
       (18, 90]  0.972973  0.900000  0.423729
male   (0, 18]   0.800000  0.600000  0.215686
       (18, 90]  0.375000  0.071429  0.133663

# Dış Kaynaklı Veri Okuma

In [44]:
import pandas as pd

In [46]:
#csv okuma
pd.read_csv("reading_data/ornekcsv.csv", sep=";")

      a    b     c
0    78   12   1.0
1    78   12   2.0
2    78  324   3.0
3     7    2   4.0
4    88   23   5.0
5     6    2   NaN
6    56   11   6.0
7     7   12   7.0
8    56   21   7.0
9   346    2   8.0
10    5    1   8.0
11  456   21   8.0
12    3   12  88.0

In [48]:
#txt okuma
pd.read_csv("reading_data/duz_metin.txt")
#burada sep'i belirtmedik çünkü metin dosyalarında ön tanımlı boşluk olsa da kabul ediyor

    1 2
0   2 2
1   3 2
2   4 2
3   5 2
4   6 2
5  7 2
6   8 2
7   9 2
8  10 2

In [51]:
#excel okuma
pd.read_excel("reading_data/ornekx.xlsx")

      a    b     c
0    78   12   1.0
1    78   12   2.0
2    78  324   3.0
3     7    2   4.0
4    88   23   5.0
5     6    2   NaN
6    56   11   6.0
7     7   12   7.0
8    56   21   7.0
9   346    2   8.0
10    5    1   8.0
11  456   21   8.0
12    3   12  88.0

In [52]:
df=pd.read_excel("reading_data/ornekx.xlsx")

In [53]:
type(df)

pandas.core.frame.DataFrame

In [54]:
df

      a    b     c
0    78   12   1.0
1    78   12   2.0
2    78  324   3.0
3     7    2   4.0
4    88   23   5.0
5     6    2   NaN
6    56   11   6.0
7     7   12   7.0
8    56   21   7.0
9   346    2   8.0
10    5    1   8.0
11  456   21   8.0
12    3   12  88.0

In [56]:
df.columns=["A","B","C"]

In [58]:
df

      A    B     C
0    78   12   1.0
1    78   12   2.0
2    78  324   3.0
3     7    2   4.0
4    88   23   5.0
5     6    2   NaN
6    56   11   6.0
7     7   12   7.0
8    56   21   7.0
9   346    2   8.0
10    5    1   8.0
11  456   21   8.0
12    3   12  88.0

In [59]:
tips=pd.read_csv("reading_data/data.txt")
tips.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4